VV_cases/V2_thermal/results/study_v2a/runs/004_data_v2a_ogrid_cylinder_validation/simulations/Re10_ogrid/openfoam_setup/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0.012632 0 0);

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform (0.012632 0 0);
    }
    outlet
    {
        type        zeroGradient;
    }
    top
    {
        type        slip;
    }
    bottom
    {
        type        slip;
    }
    cylinder
    {
        type        noSlip;
    }
    front
    {
        type        empty;
    }
    back
    {
        type        empty;
    }
}
